<%-- 
    Document   : learning_style
    Created on : Mar 31, 2014, 10:43:17 AM
    Author     : euclidres
--%>

<%@page import="java.util.*,java.text.*" %>
<%@page import="javax.servlet.*" %>
<%@page import="javax.servlet.http.*" %>

<%
    
request.getAttribute("userid");
//String userid=request.getParameter("http://localhost:8084/user_profile_sesame/form.jsp?j_ID");
//session.setAttribute("userid",userid);%>

<%@page contentType="text/html" pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
    <head>
        <title>Μαθησιακά Στυλ</title>
    </head>
    <body>
        <h2>Κωδικός χρήστη : <%=session.getAttribute("userid")%></h2>
     <h3>
         Επιλέξτε την απάντηση που εξηγεί καλύτερα την προτίμησή σας. <br>
         Παρακαλούμε επιλέξτε περισσότερες από μία απαντήσεις αν μόνο μία δεν ανταποκρίνεται στις προτιμήσεις σας. <br>
         Αφήστε κενή όποια ερώτηση δεν ισχύει.
     </h3>
        <form name="myForm" method="post" action="evaluate_ls.jsp">
            1. Βοηθάτε κάποιον που θέλει να πάει στο αεροδρόμιο, ή στο κέντρο της πόλης. Τι κάνετε:  <br>
            <input type="checkbox" name="q1" value="1.1">Πηγαίνετε μαζί του<br>
            <input type="checkbox" name="q1" value="1.2">Του λέτε τις οδηγίες<br>
            <input type="checkbox" name="q1" value="1.3">Γράφετε τις οδηγίες<br>
            <input type="checkbox" name="q1" value="1.4">Σχεδιάζετε ένα χάρτη ή του δίνετε ένα χάρτη<br><br>
            2. Δεν είστε σίγουροι για το πώς προφέρεται μια λέξη (με τον ένα ή τον άλλο τρόπο). Τι κάνετε:  <br>
            <input type="checkbox" name="q2" value="2.1">Σκέφτεστε τη λέξη και επιλέγετε ανάλογα με το πως μοιάζει<br>
            <input type="checkbox" name="q2" value="2.2">Σκέφτεστε πως ακούγεται ξεχωριστά με τον ένα ή τον άλλο τρόπο και επιλέγετε έναν<br>
            <input type="checkbox" name="q2" value="2.3">Βρίσκετε τη λέξη σε ένα λεξικό ή online<br>
            <input type="checkbox" name="q2" value="2.4">Γράφετε και τους δύο τρόπους και επιλέγετε έναν<br><br>
            3. Σχεδιάζετε διακοπές για μια ομάδα ατόμων και επιθυμείτε ανατροφοδότηση σχετικά με το σχέδιο. Τι κάνετε: <br>
            <input type="checkbox" name="q3" value="3.1">Δίνετε έμφαση και περιγράφετε μερικά από τα κύρια σημεία των διακοπών<br>
            <input type="checkbox" name="q3" value="3.2">Χρησιμοποιείτε ένα χάρτη για να τους δείξετε τα μέρη που θα επισκεφθούν<br>
            <input type="checkbox" name="q3" value="3.3">Τους δίνετε ένα αντίγραφο του δρομολογίου<br>
            <input type="checkbox" name="q3" value="3.4">Τους στέλνετε email ή τους τηλεφωνείτε<br><br>
            4. Πρόκειται να μαγειρέψετε για μια ειδική περίσταση. Τι κάνετε: <br>
            <input type="checkbox" name="q4" value="4.1">Μαγειρεύετε κάτι που ήδη ξέρετε χωρίς την χρήση οδηγιών<br>
            <input type="checkbox" name="q4" value="4.2">Ρωτάτε φίλους για προτάσεις<br>
            <input type="checkbox" name="q4" value="4.3">Ψάχνετε στο διαδίκτυο ή σε οδηγούς μαγειρικής για ιδέες, δίνοντας έμφαση στις εικόνες<br>
            <input type="checkbox" name="q4" value="4.4">Χρησιμοποιείτε μια καλή συνταγή<br><br>
            5. Ένα γκρουπ τουριστών θέλει πληροφορίες σχετικά με τα πάρκα ή τα καταφύγια άγριας ζωής στην περιοχή σας. Τι κάνετε: <br>
            <input type="checkbox" name="q5" value="5.1">Μιλάτε για αυτά ή κανονίζετε μια ομιλία με θέμα τα πάρκα ή τα καταφύγια άγριας ζωής<br>
            <input type="checkbox" name="q5" value="5.2">Τους δείχνετε χάρτες και φωτογραφίες από το διαδίκτυο<br>
            <input type="checkbox" name="q5" value="5.3">Πηγαίνετε μαζί τους στα πάρκα ή στα καταφύγια άγριας ζωής<br>
            <input type="checkbox" name="q5" value="5.4">Τους δίνετε ένα βιβλίο ή φυλλάδια σχετικά με τα πάρκα ή καταφύγια άγριας ζωής<br><br>
            6. Ετοιμάζεστε να παραγγείλετε μια ψηφιακή κάμερα ή ένα κινητό τηλέφωνο. Εκτός από την τιμή, τι άλλο θα επηρέαζε την επιλογή σας? <br>
            <input type="checkbox" name="q6" value="6.1">Το δοκιμάζετε<br>
            <input type="checkbox" name="q6" value="6.2">Διαβάζετε τις λεπτομέρειες ή ελέγχτε τα χαρακτηριστικά στο διαδίκτυο<br>
            <input type="checkbox" name="q6" value="6.3">Έχει μοντέρνα εμφάνιση<br>
            <input type="checkbox" name="q6" value="6.4">Οι οδηγίες που μου λέει ο πωλητής σχετικά με τα χαρακτηριστικά<br><br>
            7. Θυμηθείτε μια φορά όταν μάθατε να κάνετε κάτι καινούργιο. Εκτός από μια φυσική δραστηριότητα (π.χ ποδήλατο), μάθατε καλύτερα: <br>
            <input type="checkbox" name="q7" value="7.1">Παρακολουθώντας μια επίδειξη<br>
            <input type="checkbox" name="q7" value="7.2">Ακούγωντας κάποιον να εξηγεί και μετά κάνοντας ερωτήσεις<br>
            <input type="checkbox" name="q7" value="7.3">Μέσω διαγραμμάτων, χαρτών και γενικότερα μέσω οπτικών ενδείξεων<br>
            <input type="checkbox" name="q7" value="7.4">Μέσω γραπτών οδηγιών - εγχειρίδιο ή βιβλίο<br><br>
            8. Έχετε ένα πρόβλημα με την καρδιά σας. Τι από τα παρακάτω προτιμάτε να πράξει ο γιατρός σας: <br>
            <input type="checkbox" name="q8" value="8.1">Να σας δώσει να διαβάσετε κάτι για να καταλάβετε ποιό είναι το πρόβλημα<br>
            <input type="checkbox" name="q8" value="8.2">Να χρησιμοποιήσει ένα πλαστικό μοντέλο για να σας δείξει ποιό είναι το πρόβλημα<br>
            <input type="checkbox" name="q8" value="8.3">Να σας περιγράψει ποιό είναι το πρόβλημα<br>
            <input type="checkbox" name="q8" value="8.4">Να σας δείξει ένα διάγραμμα ή γράφημα με το πρόβλημα<br><br>
            9. Θέλετε να μάθετε ένα νέο πρόγραμμα ή παιχνίδι στον υπολογιστή σας. Τι κάνετε: <br>
            <input type="checkbox" name="q9" value="9.1">Διαβάζετε τις γραπτές οδηγίες του προγράμματος<br>
            <input type="checkbox" name="q9" value="9.2">Μιλάτε με ανθρώπους που γνωρίζουν το πρόγραμμα<br>
            <input type="checkbox" name="q9" value="9.3">Χρησιμοποιείτε το πληκτρολόγιο<br>
            <input type="checkbox" name="q9" value="9.4">Ακολουθείτε τα διαγράμματα ή γραφήματα στο βιβλίο που το συνοδεύουν<br><br>
            10. Σας αρέσουν ιστοσελίδες που έχουν: <br>
            <input type="checkbox" name="q10" value="10.1">Στοιχεία που μπορείτε να κάνετε κλικ, να μετακινήσετε ή να δοκιμάσετε<br>
            <input type="checkbox" name="q10" value="10.2">Ενδιαφέρον σχεδιασμό και οπτικά εφέ<br>
            <input type="checkbox" name="q10" value="10.3">Γραπτές οδηγίες, λίστες και επεξηγήσεις<br>
            <input type="checkbox" name="q10" value="10.4">Ακουστικά κανάλια όπου μπορείτε να ακούσετε μουσική, προγράμματα ραδιοφώνου ή συνεντεύξεις<br><br>
            11. Εκτός από την τιμή, τι θα σας επηρέαζε περισσότερο στην επιλογή ενός λογοτεχνικού βιβλίου? <br>
            <input type="checkbox" name="q11" value="11.1">Η εμφάνιση του βιβλίου<br>
            <input type="checkbox" name="q11" value="11.2">Ρίχνοντας μια γρήγορη ματιά στο περιεχόμενο του βιβλίου<br>
            <input type="checkbox" name="q11" value="11.3">Γνώμες φίλων που το έχουν διαβάσει<br>
            <input type="checkbox" name="q11" value="11.4">Έχει πραγματικές ιστορίες, εμπειρίες και παραδείγματα<br><br>
            12. Χρησιμοποιείτε ένα CD, βιβλίο ή ιστοσελίδα για να μάθετε να βγάζετε φωτογραφίες με τη νέα σας κάμερα. Θα προτιμούσατε να έχετε: <br>
            <input type="checkbox" name="q12" value="12.1">Την ευκαιρία να κάνετε ερωτήσεις και να μιλήσετε σχετικά με τα χαρακτηριστικά της κάμερας<br>
            <input type="checkbox" name="q12" value="12.2">Καθαρές γραπτές οδηγίες με λίστες και κουκκίδες σχετικά με το τι πρέπει να κάνετε<br>
            <input type="checkbox" name="q12" value="12.3">Διαγράμματα με τα μέρη της κάμερας και τι κάνει το κάθε ένα<br>
            <input type="checkbox" name="q12" value="12.4">Παραδείγματα με καλές και κακές φωτογραφίες και πως να τις βελτιώσετε<br><br>
            13. Προτιμάτε έναν δάσκαλο ή ομιλητή που χρησιμοποιεί: <br>
            <input type="checkbox" name="q13" value="13.1">Παραδείγματα, μοντέλα ή πρακτικές εφαρμογές<br>
            <input type="checkbox" name="q13" value="13.2">Ερωτήσεις και απαντήσεις, ομιλία, ομαδική συζήτηση ή καλεσμένους ομιλητές<br>
            <input type="checkbox" name="q13" value="13.3">Έντυπα, βιβλία ή αναλύσεις<br>
            <input type="checkbox" name="q13" value="13.4">Διαγράμματα, γραφήματα ή γραφικές παραστάσεις<br><br>
            14. Έχετε μόλις ολοκληρώσει ένα τεστ ή διαγωνισμό και επιθυμείτε κάποια ανατροφοδότηση. Πώς θα θέλατε να είναι αυτή η ανατροφοδότηση: <br>
            <input type="checkbox" name="q14" value="14.1">Με τη χρήση παραδειγμάτων από ότι έχετε κάνει<br>
            <input type="checkbox" name="q14" value="14.2">Μέσω γραπτών επεξηγήσεων των αποτελεσμάτων σας<br>
            <input type="checkbox" name="q14" value="14.3">Από κάποιον με τον οποίο θα συζητήσετε με λεπτομέρειες σχετικά με το τεστ<br>
            <input type="checkbox" name="q14" value="14.4">Μέσω γραφημάτων που απεικονίζουν αυτό που έχετε επιτύχει<br><br>
            15. Πρόκειται να παραγγείλετε σε ένα εστιατόριο ή καφετέρια. Τι κάνετε: <br>
            <input type="checkbox" name="q15" value="15.1">Παραγγέλνετε κάτι που έχετε ήδη δοκιμάσει ξανά εκεί<br>
            <input type="checkbox" name="q15" value="15.2">Ακούτε τον σερβιτόρο ή ρωτάτε τους φίλους σας να σας προτείνουν<br>
            <input type="checkbox" name="q15" value="15.3">Επιλέγετε με βάση τις περιγραφές στο μενού<br>
            <input type="checkbox" name="q15" value="15.4">Κοιτάτε τι έχουν παραγγείλει οι υπόλοιποι θαμώνες ή κοιτάζετε φωτογραφίες του κάθε πιάτου<br><br>
            16. Πρέπει να κάντε μια σημαντική ομιλία σε ένα συνέδριο ή κάποια ειδική περίσταση. Τι κάνετε: <br>
            <input type="checkbox" name="q16" value="16.1">Χρησιμοποιείτε διαγράμματα ή γραφήματα ώστε να εξηγήσετε στο κοινό που σας παρακολουθεί<br>
            <input type="checkbox" name="q16" value="16.2">Γράφετε μερικές λέξεις κλειδιά και κάνετε πρόβα την ομιλία σας ξανά και ξανά<br>
            <input type="checkbox" name="q16" value="16.3">Γράφετε το λόγο σας και τον αποστηθίζετε επαναλαμβάνοντάς τον πολλές φορές<br>
            <input type="checkbox" name="q16" value="16.4">Συγκεντρώνετε πολλά παραδείγματα και ιστορίες ώστε να κάνετε την ομιλία σας πραγματική και πρακτική<br><br>
            <input type="submit" value="Ολοκλήρωση ερωτηματολογίου">
        </form>
    </body>
</html>
