<%-- 
    Document   : social_solitary
    Created on : Mar 31, 2014, 11:16:48 AM
    Author     : euclidres
--%>

<%@page contentType="text/html" pageEncoding="UTF-8"%>

<%request.getAttribute("userid");%>

<!DOCTYPE html>
<html>
    <head>
        <title>Εξωστρεφής ή Εσωστρεφής τύπος εκπαιδευόμενου</title>
    </head>
    <body>
        <form action="evaluate_social_solitary.jsp" method="post">
        <h2>Κωδικός χρήστη : <%=session.getAttribute("userid")%></h2>
        <h3>Παρακαλούμε επιλέξτε ποιά χαρακτηριστικά ταιριάζουν περισσότερο στην προσωπικότητά σας</h3>
        <table width="95%" border="1" cellspacing="0" cellpadding="6" align="center">
              <tbody><tr>
                <td width="100%" colspan="2" valign="top"><p> </p>
                    <p class="directory4"><b>Που επικεντρώνετε περισσότερο την προσοχής σας?</b></p>
                    <blockquote>
                      <p><span class="directory4">Κάθε άνθρωπος έχει δύο πλευρές. Η μία έχει κατεύθυνση προς τον <strong>ΕΞΩΤΕΡΙΚΟ</strong> κόσμο των δραστηριοτήτων, των ανθρώπων, και των πραγμάτων. Η άλλη πλευρά έχει κατεύθυνση προς τον <strong>ΕΣΩΤΕΡΙΚΟ</strong> κόσμο των σκέψεων, ενδιαφερόντων, ιδεών, και της φαντασίας.<br>
                      <br>
          Αν και αυτές είναι δύο διαφορετικές αλλά συμπληρωματικές πλευρές της φύσης μας, οι περισσότεροι άνθρωποι έχουν μια έμφυτη τάση προς την <b>ενέργεια</b> είτε από τον ΕΣΩΤΕΡΙΚΟ ή από τον ΕΣΩΤΕΡΙΚΟ κόσμο. Επομένως μία από τις δύο πλευρές, είτε η <i><b>Εξωστρεφής</b></i> ή <i><b>Εσωστρεφής</b></i>, υπερισχύει στην ανάπτυξη της προσωπικότητας και παίζει ένα πιο <strong>κυρίαρχο ρόλο</strong> στη συμπεριφορά τους. </span><br>
                      </p>
                </blockquote></td>
              </tr>
              <tr>
                <td width="50%" valign="top"><p> &nbsp;<span class="directory4"><b>Εξωστρεφή Χαρακτηριστικά</b> </span></p>
                    <ul>
                      <li>
                        <p class="directory4"> Πρώτα ενεργείτε και μετά σκέφτεστε </p>
                      </li>
                      <li>
                        <p class="directory4"> Νιώθετε στερημένος όταν αποκοπεί η αλληλεπίδρασή σας με τον έξω κόσμο </p>
                      </li>
                      <li>
                        <p class="directory4"> Είστε συνήθως ανοιχτοί και ενθουσιώδεις προς τον έξω κόσμο των ανθρώπων και των πραγμάτων </p>
                      </li>
                      <li>
                        <p class="directory4"> Απολαμβάνετε τη μεγάλη ποικιλία και αλλαγές στις ανθρώπινες σχέσεις </p>
                  </li>
                  <li>
                        <p class="directory4"> Προτιμάτε τις κοινωνικές δραστηριότητες,ενώ σας αρέσουν τα παιχνίδια και σπορ που περιλαμβάνουν και άλλους ανθρώπους όπως ποδόσφαιρο, μπάσκετ κλπ  </p>
                  </li>
                  <li>
                        <p class="directory4"> Προτιμάτε να επεξεργάζεστε ζητήματα, προβλήματα και ιδέες μέσα σε ομάδες. Απολαμβάνετε να δουλεύετε με μια συνεργατική ομάδα ανθρώπων. </p>
                  </li>
                    </ul></td>
                <td width="50%" valign="top"><p class="directory4"> <b>Εσωστρεφή Χαρακτηριστικά</b> </p>
                    <ul>
                      <li>
                        <p class="directory4"> Πρώτα σκέφτεστε και μετά ενεργείτε </p>
                      </li>
                      <li>
                        <p class="directory4"> Τακτικά απαιτείτε ένα ποσό "ιδιωτικού χρόνου" για να επαναφορτίσετε τις μπαταρίες </p>
                      </li>
                      <li>
                        <p class="directory4"> Παρακινούμενοι εσωτερικά, το μυαλό σας είναι μερικές φορές τόσο ενεργό που είναι "κλειστό" προς τον έξω κόσμο </p>
                      </li>
                      <li>
                        <p class="directory4"> Προτιμάτε την ένα - προς - ένα επικοινωνία και σχέσεις </p>
                </li>
                <li>
                        <p class="directory4"> Προτιμάτε να περνάτε χρόνο μόνος/μόνη, ενώ έχετε ένα προσωπικό χόμπυ και σας αρέσουν τα ατομικά παιχνίδια ή σπορ </p>
                </li>
                <li>
                        <p class="directory4"> Προτιμάτε να δουλεύετε πάνω σε κάποιο πρόβλημα κάπου ήσυχα όπου επεξεργάζεστε όλες τις πιθανές λύσεις, πολλές φορές σπαταλώντας πολύ χρόνο προσπαθώντας να λύσετε το πρόβλημα αυτό </p>
                </li>
                    </ul></td>
              </tr>
              <tr>
                <td colspan="2"><table width="100%" border="0" cellpadding="3" cellspacing="0">
                    <tbody><tr>
                      <td width="35%"> <strong class="style22">Επιλέξτε ποιό ταιριάζει περισσότερο</strong>:</td>
                      <td width="34%"><input type="radio" value="E" name="Energy">                        
                      <strong class="style22">Εξωστρέφεια</strong></td>
                      <td width="31%"><input type="radio" value="I" name="Energy">                        
                      <b class="style22">Εσωστρέφεια</b></td>
                    </tr>
                </tbody></table></td>
              </tr>
            </tbody></table>
        <br>
        
      <button type="submit"> Ολοκλήρωση </button>
      </form>
    </body>
</html>

